yulei/amk/main/porting/wired/m480/gpio_m480.h
/**
 * @file gpio_m480.h
 * @author astro
 * 
 * @copyright Copyright (c) 2022
 * 
 */

    #include "amk_hal.h"
    typedef uint32_t pin_t;
    typedef uint32_t port_t;

    #define PIN_P(x) (1<<(x))
    #define MAKE_PIN(port, pin) ((GPIO_PIN_DATA_BASE+(0x40*(port))) + ((pin)<<2))
    #define GET_PIN(port_pin)   PIN_P((((port_pin)%0x40)>>2))

    #define A0      MAKE_PIN(0,0)
    #define A1      MAKE_PIN(0,1)
    #define A2      MAKE_PIN(0,2)
    #define A3      MAKE_PIN(0,3)
    #define A4      MAKE_PIN(0,4)
    #define A5      MAKE_PIN(0,5)
    #define A6      MAKE_PIN(0,6)
    #define A7      MAKE_PIN(0,7)
    #define A8      MAKE_PIN(0,8)
    #define A9      MAKE_PIN(0,9)
    #define A10     MAKE_PIN(0,10)
    #define A11     MAKE_PIN(0,11)
    #define A12     MAKE_PIN(0,12)
    #define A13     MAKE_PIN(0,13)
    #define A14     MAKE_PIN(0,14)
    #define A15     MAKE_PIN(0,15)
    #define B0      MAKE_PIN(1,0)
    #define B1      MAKE_PIN(1,1)
    #define B2      MAKE_PIN(1,2)
    #define B3      MAKE_PIN(1,3)
    #define B4      MAKE_PIN(1,4)
    #define B5      MAKE_PIN(1,5)
    #define B6      MAKE_PIN(1,6)
    #define B7      MAKE_PIN(1,7)
    #define B8      MAKE_PIN(1,8)
    #define B9      MAKE_PIN(1,9)
    #define B10     MAKE_PIN(1,10)
    #define B11     MAKE_PIN(1,11)
    #define B12     MAKE_PIN(1,12)
    #define B13     MAKE_PIN(1,13)
    #define B14     MAKE_PIN(1,14)
    #define B15     MAKE_PIN(1,15)
    #define C0      MAKE_PIN(2,0)
    #define C1      MAKE_PIN(2,1)
    #define C2      MAKE_PIN(2,2)
    #define C3      MAKE_PIN(2,3)
    #define C4      MAKE_PIN(2,4)
    #define C5      MAKE_PIN(2,5)
    #define C6      MAKE_PIN(2,6)
    #define C7      MAKE_PIN(2,7)
    #define C8      MAKE_PIN(2,8)
    #define C9      MAKE_PIN(2,9)
    #define C10     MAKE_PIN(2,10)
    #define C11     MAKE_PIN(2,11)
    #define C12     MAKE_PIN(2,12)
    #define C13     MAKE_PIN(2,13)
    #define C14     MAKE_PIN(2,14)
    #define C15     MAKE_PIN(2,15)
    #define D0      MAKE_PIN(3,0)
    #define D1      MAKE_PIN(3,1)
    #define D2      MAKE_PIN(3,2)
    #define D3      MAKE_PIN(3,3)
    #define D4      MAKE_PIN(3,4)
    #define D5      MAKE_PIN(3,5)
    #define D6      MAKE_PIN(3,6)
    #define D7      MAKE_PIN(3,7)
    #define D8      MAKE_PIN(3,8)
    #define D9      MAKE_PIN(3,9)
    #define D10     MAKE_PIN(3,10)
    #define D11     MAKE_PIN(3,11)
    #define D12     MAKE_PIN(3,12)
    #define D13     MAKE_PIN(3,13)
    #define D14     MAKE_PIN(3,14)
    #define D15     MAKE_PIN(3,15)
    #define E0      MAKE_PIN(4,0)
    #define E1      MAKE_PIN(4,1)
    #define E2      MAKE_PIN(4,2)
    #define E3      MAKE_PIN(4,3)
    #define E4      MAKE_PIN(4,4)
    #define E5      MAKE_PIN(4,5)
    #define E6      MAKE_PIN(4,6)
    #define E7      MAKE_PIN(4,7)
    #define E8      MAKE_PIN(4,8)
    #define E9      MAKE_PIN(4,9)
    #define E10     MAKE_PIN(4,10)
    #define E11     MAKE_PIN(4,11)
    #define E12     MAKE_PIN(4,12)
    #define E13     MAKE_PIN(4,13)
    #define E14     MAKE_PIN(4,14)
    #define E15     MAKE_PIN(4,15)
    #define F0      MAKE_PIN(5,0)
    #define F1      MAKE_PIN(5,1)
    #define F2      MAKE_PIN(5,2)
    #define F3      MAKE_PIN(5,3)
    #define F4      MAKE_PIN(5,4)
    #define F5      MAKE_PIN(5,5)
    #define F6      MAKE_PIN(5,6)
    #define F7      MAKE_PIN(5,7)
    #define F8      MAKE_PIN(5,8)
    #define F9      MAKE_PIN(5,9)
    #define F10     MAKE_PIN(5,10)
    #define F11     MAKE_PIN(5,11)
    #define F12     MAKE_PIN(5,12)
    #define F13     MAKE_PIN(5,13)
    #define F14     MAKE_PIN(5,14)
    #define F15     MAKE_PIN(5,15)
    #define G0      MAKE_PIN(6,0)
    #define G1      MAKE_PIN(6,1)
    #define G2      MAKE_PIN(6,2)
    #define G3      MAKE_PIN(6,3)
    #define G4      MAKE_PIN(6,4)
    #define G5      MAKE_PIN(6,5)
    #define G6      MAKE_PIN(6,6)
    #define G7      MAKE_PIN(6,7)
    #define G8      MAKE_PIN(6,8)
    #define G9      MAKE_PIN(6,9)
    #define G10     MAKE_PIN(6,10)
    #define G11     MAKE_PIN(6,11)
    #define G12     MAKE_PIN(6,12)
    #define G13     MAKE_PIN(6,13)
    #define G14     MAKE_PIN(6,14)
    #define G15     MAKE_PIN(6,15)
    #define H0      MAKE_PIN(7,0)
    #define H1      MAKE_PIN(7,1)
    #define H2      MAKE_PIN(7,2)
    #define H3      MAKE_PIN(7,3)
    #define H4      MAKE_PIN(7,4)
    #define H5      MAKE_PIN(7,5)
    #define H6      MAKE_PIN(7,6)
    #define H7      MAKE_PIN(7,7)
    #define H8      MAKE_PIN(7,8)
    #define H9      MAKE_PIN(7,9)
    #define H10     MAKE_PIN(7,10)
    #define H11     MAKE_PIN(7,11)
    #define H12     MAKE_PIN(7,12)
    #define H13     MAKE_PIN(7,13)
    #define H14     MAKE_PIN(7,14)
    #define H15     MAKE_PIN(7,15)
    #if 0
    #define I0      MAKE_PIN(8,1)
    #define I1      MAKE_PIN(8,1)
    #define I2      MAKE_PIN(8,2)
    #define I3      MAKE_PIN(8,3)
    #define I4      MAKE_PIN(8,4)
    #define I5      MAKE_PIN(8,5)
    #define I6      MAKE_PIN(8,6)
    #define I7      MAKE_PIN(8,7)
    #define I8      MAKE_PIN(8,8)
    #define I9      MAKE_PIN(8,9)
    #define I10     MAKE_PIN(8,10)
    #define I11     MAKE_PIN(8,11)
    #define I12     MAKE_PIN(8,12)
    #define I13     MAKE_PIN(8,13)
    #define I14     MAKE_PIN(8,14)
    #define I15     MAKE_PIN(8,15)
    #endif